
class CPlayerCharacter
{
public:
	int32_t m_iBlueCharID; //0x0000
	char pad_0004[16]; //0x0004
	int32_t m_iRedCharID; //0x0014
	char pad_0018[44]; //0x0018
}; //Size: 0x0044

class CPlayerInfo
{
public:
	uint8_t m_bIndex; //0x0000
	char pad_0001[55]; //0x0001
	char m_szLoginName[16]; //0x0038
	char pad_0048[36]; //0x0048
	uint8_t m_bPadding00; //0x006C
	uint8_t m_bPadding01; //0x006D
	wchar_t m_szName[16]; //0x006E
	char pad_008E[30]; //0x008E
	uint8_t m_bPadding02; //0x00AC
	uint8_t m_bPadding03; //0x00AD
	wchar_t m_szClanName[16]; //0x00AE
	char pad_00CE[198]; //0x00CE
	int32_t m_iMaxHealth; //0x0194
	char pad_0198[32]; //0x0198
	class CPlayerCharacter* m_pCharacter; //0x01B8
	char pad_01BC[16]; //0x01BC
}; //Size: 0x01CC

class CLTObject
{
public:
	char pad_0000[4]; //0x0000
	D3DXVECTOR3 m_vMaxPos; //0x0004
	D3DXVECTOR3 m_vMinPos; //0x0010
	char pad_001C[168]; //0x001C
	D3DXVECTOR3 m_vRootPos; //0x00C4
	char pad_00D0[204]; //0x00D0
}; //Size: 0x019C

class CPlayerObject
{
public:
	char pad_0000[8]; //0x0000
	class CLTObject* m_pLTObject; //0x0008
	char pad_000C[4000]; //0x000C
	uint8_t m_bTeamID; //0x0FAC
	char pad_0FAD[207]; //0x0FAD
	uint8_t m_bIsDead; //0x107C
	char pad_107D[3]; //0x107D
	bool m_bIsInvulnerable; //0x1080
	char pad_1081[31603]; //0x1081
	float m_fHealth; //0x8BF4
	char pad_8BF8[8]; //0x8BF8
	bool m_bIsWolf; //0x8C00
	char pad_8C01[1087]; //0x8C01
}; //Size: 0x9040

class CPlayerObject1
{
public:
	BYTE m_pad01[0x2C];
	D3DXVECTOR3 vPos;
};

class CPlayerInfo1
{
public:
	__int32 PlayerIndex;
	char _0x0004[60];
	CPlayerObject* pObject;
};

class CILTDrawPrimitive
{
public:
	char _0x0000[17212];
	D3DVIEWPORT9 ViewPort;
	char _0x4348[12];
	D3DXMATRIX World;
	char _0x4360[52];
	D3DXMATRIX View;
	char _0x43A0[52];
	D3DXMATRIX Projection;
	char _0x43E0[12];
};

BOOL bWorldToScreen(IDirect3DDevice9* pDevice, D3DXVECTOR3 vPos, D3DXVECTOR3* vPosOut)
{
	// Setup Pointer
	CILTDrawPrimitive* pDrawPrimPrimitive = (CILTDrawPrimitive*)pDevice;

	// Execute
	D3DXVec3Project(vPosOut, &vPos, &pDrawPrimPrimitive->ViewPort, &pDrawPrimPrimitive->Projection, &pDrawPrimPrimitive->View, &pDrawPrimPrimitive->World);

	// Return
	return (vPosOut->z < 1.0f);
}

/*void DrawEsp(IDirect3DDevice9* pDevice)
{
	// Setup Pointers
